In [1]:
import pandas as pd
import numpy as np

"""You are given a DataFrame containing order_id, customer_id, order_date, and order_amount.
Task:
Convert order_date to datetime
Find the monthly total revenue
Identify the month with the highest number of unique customers
"""

In [2]:
data = {
    'order_id': [101, 102, 103, 104, 105, 106],
    'customer_id': ['C1', 'C2', 'C1', 'C3', 'C2', 'C4'],
    'order_date': ['2024-01-15', '2024-01-20', '2024-02-05',
                   '2024-02-18', '2024-02-25', '2024-03-10'],
    'order_amount': [250, 300, 150, 400, 200, 500]
}

df = pd.DataFrame(data)
df

   order_id customer_id  order_date  order_amount
0       101          C1  2024-01-15           250
1       102          C2  2024-01-20           300
2       103          C1  2024-02-05           150
3       104          C3  2024-02-18           400
4       105          C2  2024-02-25           200
5       106          C4  2024-03-10           500

In [3]:
#Convert order_date to datetime
df["order_date"] = pd.to_datetime(df["order_date"])
df

   order_id customer_id order_date  order_amount
0       101          C1 2024-01-15           250
1       102          C2 2024-01-20           300
2       103          C1 2024-02-05           150
3       104          C3 2024-02-18           400
4       105          C2 2024-02-25           200
5       106          C4 2024-03-10           500

In [4]:
#Find the monthly total revenue
monthly_revenue = (df.groupby(df['order_date'].dt.to_period('M'))['order_amount'].sum())
monthly_revenue

order_date
2024-01    550
2024-02    750
2024-03    500
Freq: M, Name: order_amount, dtype: int64

In [5]:
#Identify the month with the highest number of unique customers
monthly_customers = (df.groupby(df['order_date'].dt.to_period('M'))['customer_id'].nunique())
print("Monthly Customers : ")
print(monthly_customers)

unique_customers = monthly_customers.idxmax()
print("Month with highest number of Unique Customers : ")
print(unique_customers)

Monthly Customers :
order_date
2024-01    2
2024-02    3
2024-03    1
Freq: M, Name: customer_id, dtype: int64
Month with highest number of Unique Customers :
2024-02

"""A DataFrame contains emp_id, department, quarter, and performance_score.
Task:
Group data by department
Compute the quarter-wise average performance per department
Identify departments showing consistent improvement across quarters
"""

In [6]:
data = {
    'emp_id': [101, 102, 103, 104, 105, 106, 107, 108],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'Finance', 'IT', 'HR'],
    'quarter': ['Q1', 'Q1', 'Q1', 'Q2', 'Q2', 'Q2', 'Q3', 'Q3'],
    'performance_score': [78, 85, 88, 90, 82, 91, 87, 80]
}

df = pd.DataFrame(data)
df

   emp_id department quarter  performance_score
0     101         HR      Q1                 78
1     102         IT      Q1                 85
2     103    Finance      Q1                 88
3     104         IT      Q2                 90
4     105         HR      Q2                 82
5     106    Finance      Q2                 91
6     107         IT      Q3                 87
7     108         HR      Q3                 80

In [7]:
#Group data by department
result = df.groupby('department')

In [8]:
for dept, data in result:
    print(dept)
    print(data)

Finance
   emp_id department quarter  performance_score
2     103    Finance      Q1                 88
5     106    Finance      Q2                 91
HR
   emp_id department quarter  performance_score
0     101         HR      Q1                 78
4     105         HR      Q2                 82
7     108         HR      Q3                 80
IT
   emp_id department quarter  performance_score
1     102         IT      Q1                 85
3     104         IT      Q2                 90
6     107         IT      Q3                 87

In [9]:
#Compute the quarter-wise average performance per department
quarte_mean = df.groupby(['department', 'quarter'])['performance_score'].mean()

In [10]:
quarte_mean

department  quarter
Finance     Q1         88.0
            Q2         91.0
HR          Q1         78.0
            Q2         82.0
            Q3         80.0
IT          Q1         85.0
            Q2         90.0
            Q3         87.0
Name: performance_score, dtype: float64

""" A DataFrame contains date, city, temperature, and humidity.
Task:
Filter data for a single city
Compute rolling 3-day average temperature
Detect days where humidity increased compared to the previous day
"""

In [22]:
data = {
    'date' : pd.to_datetime(['2024-01-15', '2024-01-20', '2024-02-05', '2024-02-18', '2024-02-25', '2024-03-10']),
    'city' : ['Delhi', 'Bangalore', 'Delhi', 'Delhi', 'Chennai', 'Hyderabad'],
    'temperature' : [28, 20, 23, 26, 22, 28],
    'humidity' : [33, 32, 35, 36, 37, 38]
}

df = pd.DataFrame(data)
df

        date       city  temperature  humidity
0 2024-01-15      Delhi           28        33
1 2024-01-20  Bangalore           20        32
2 2024-02-05      Delhi           23        35
3 2024-02-18      Delhi           26        36
4 2024-02-25    Chennai           22        37
5 2024-03-10  Hyderabad           28        38

In [23]:
#Filter data for a single city
filtered_data = df[df['city'] == 'Delhi']
filtered_data

        date   city  temperature  humidity
0 2024-01-15  Delhi           28        33
2 2024-02-05  Delhi           23        35
3 2024-02-18  Delhi           26        36

In [24]:
#Compute rolling 3-day average temperature
df["average_temperature"] = (df['temperature'].rolling(window = 3).mean())
df

        date       city  temperature  humidity  average_temperature
0 2024-01-15      Delhi           28        33                  NaN
1 2024-01-20  Bangalore           20        32                  NaN
2 2024-02-05      Delhi           23        35            23.666667
3 2024-02-18      Delhi           26        36            23.000000
4 2024-02-25    Chennai           22        37            23.666667
5 2024-03-10  Hyderabad           28        38            25.333333

In [25]:
#Detect days where humidity increased compared to the previous day
df["humidity_increased"] = (df['humidity'] > df['humidity'].shift(1))
df["humidity_increased"]

0    False
1    False
2     True
3     True
4     True
5     True
Name: humidity_increased, dtype: bool

"""A DataFrame contains student_id, course_id, login_date, and minutes_spent.
Task:
Identify inactive students (no login in last 7 days)
Calculate average session duration per course
Find top 3 courses with highest engagement
"""

In [3]:
data = {
    'student_id' : [101, 102, 101, 103, 104, 105],
    'course_id' : ['C01', 'C02', 'C03', 'C04', 'C05', 'C06'],
    'login_date' : pd.to_datetime(['2024-01-15', '2024-01-20', '2024-02-05', '2024-02-18', '2024-02-25', '2024-03-10']),
    'minutes_spent' : [200, 202, 203, 204, 206, 210]
}
df = pd.DataFrame(data)
df

   student_id course_id login_date  minutes_spent
0         101       C01 2024-01-15            200
1         102       C02 2024-01-20            202
2         101       C03 2024-02-05            203
3         103       C04 2024-02-18            204
4         104       C05 2024-02-25            206
5         105       C06 2024-03-10            210

In [9]:
last_login = df['login_date'].max()
print(last_login)

2024-03-10 00:00:00

In [10]:
login = df.groupby('student_id')['login_date'].max()

In [12]:
inactive_students = login[login < (last_login - pd.Timedelta(days=7))]
inactive_students

student_id
101   2024-02-05
102   2024-01-20
103   2024-02-18
104   2024-02-25
Name: login_date, dtype: datetime64[ns]

In [13]:
#Calculate average session duration per course
avrage_duration = (df.groupby('course_id')['minutes_spent'].mean())
avrage_duration

course_id
C01    200.0
C02    202.0
C03    203.0
C04    204.0
C05    206.0
C06    210.0
Name: minutes_spent, dtype: float64

In [17]:
#Find top 3 courses with highest engagement
highest_engagement = avrage_duration.sort_values(ascending = False).head(3)
highest_engagement

course_id
C06    210.0
C05    206.0
C04    204.0
Name: minutes_spent, dtype: float64

""" A DataFrame contains account_id, transaction_date, amount, and transaction_type.
Task:
Aggregate daily transaction totals per account
Identify accounts with unusually high transaction volume
Detect potential fraud using statistical thresholds
"""

In [18]:
data = {
    'account_id' : ['101', '102', '103', '101', '105', '104'],
    'transaction_date' : pd.to_datetime(['2024-01-15', '2024-01-20', '2024-02-05', '2024-02-18', '2024-02-25', '2024-03-10']),
    'amount' : [30000, 40000, 25000, 50000, 23000, 24000],
    'transaction_type' : ['credit', 'debit', 'debit', 'debit', 'credit', 'debit']
}
df = pd.DataFrame(data)
df

  account_id transaction_date  amount transaction_type
0        101       2024-01-15   30000           credit
1        102       2024-01-20   40000            debit
2        103       2024-02-05   25000            debit
3        101       2024-02-18   50000            debit
4        105       2024-02-25   23000           credit
5        104       2024-03-10   24000            debit

In [20]:
#Aggregate daily transaction totals per account
daily_transaction = (df.groupby(['transaction_date', 'account_id'])['amount'].sum())
daily_transaction

transaction_date  account_id
2024-01-15        101           30000
2024-01-20        102           40000
2024-02-05        103           25000
2024-02-18        101           50000
2024-02-25        105           23000
2024-03-10        104           24000
Name: amount, dtype: int64

In [21]:
#Identify accounts with unusually high transaction volume
transaction = (df.groupby('account_id')['amount'].sum())
transaction

account_id
101    80000
102    40000
103    25000
104    24000
105    23000
Name: amount, dtype: int64

In [24]:
#Detect potential fraud using statistical thresholds
mean = transaction.mean()
std = transaction.std()

thresold = mean + 2 * std
print(thresold)
potential_fraud = transaction[transaction > thresold]
potential_fraud

86951.004109081

Series([], Name: amount, dtype: int64)

""" A DataFrame contains patient_id, timestamp, heart_rate, and ward.
Task:
Compute average heart rate per ward
Identify patients with sudden spikes in heart rate
Extract data for critical cases
"""

In [25]:
data = {
    "patient_id": [1, 1, 1, 2, 2, 3, 3],
    "timestamp": pd.to_datetime(["2024-01-01 08:00", "2024-01-01 12:00", "2024-01-01 16:00", "2024-01-01 09:00", "2024-01-01 18:00", "2024-01-01 10:00", "2024-01-01 14:00"]),
    "heart_rate": [72, 75, 120, 68, 70, 80, 140],
    "ward": ["ICU", "ICU", "ICU", "General", "General", "ICU", "ICU"]
}

df = pd.DataFrame(data)
print(df)

   patient_id           timestamp  heart_rate     ward
0           1 2024-01-01 08:00:00          72      ICU
1           1 2024-01-01 12:00:00          75      ICU
2           1 2024-01-01 16:00:00         120      ICU
3           2 2024-01-01 09:00:00          68  General
4           2 2024-01-01 18:00:00          70  General
5           3 2024-01-01 10:00:00          80      ICU
6           3 2024-01-01 14:00:00         140      ICU

In [26]:
#Compute average heart rate per ward
average_heart_rate = (df.groupby('ward')['heart_rate'].mean())
average_heart_rate

ward
General    69.0
ICU        97.4
Name: heart_rate, dtype: float64

In [28]:
#Identify patients with sudden spikes in heart rate
df = df.sort_values(["patient_id", "timestamp"])
df["prev_heart_rate"] = df.groupby("patient_id")["heart_rate"].shift(1)
df["sudden_spike"] = (df["heart_rate"] - df["prev_heart_rate"] > 30)

spike_patients = df[df["sudden_spike"]]

print(spike_patients)

   patient_id           timestamp  heart_rate ward  prev_heart_rate  \
2           1 2024-01-01 16:00:00         120  ICU             75.0
6           3 2024-01-01 14:00:00         140  ICU             80.0

   sudden_spike
2          True
6          True

In [29]:
#Extract data for critical cases
critical_cases = df[(df["heart_rate"] > 120) | (df["sudden_spike"]) | (df["ward"] == "ICU") ]
critical_cases

,patient_id,timestamp,heart_rate,ward,prev_heart_rate,sudden_spike
0,1,2024-01-01 08:00:00,72,ICU,NaN,False
1,1,2024-01-01 12:00:00,75,ICU,72.0,False
2,1,2024-01-01 16:00:00,120,ICU,75.0,True
5,3,2024-01-01 10:00:00,80,ICU,NaN,False
6,3,2024-01-01 14:00:00,140,ICU,80.0,True

""" A DataFrame contains date, stock_name, open_price, and close_price.
Task:
Calculate percentage daily return
Identify top gaining and losing stocks per month
Compute rolling volatility
"""

In [30]:
data = {
    "date": pd.to_datetime(["2024-01-01", "2024-01-02", "2024-01-01", "2024-01-02", "2024-02-01", "2024-02-02"]),
    "stock_name": ["AAPL", "AAPL", "GOOG", "GOOG", "AAPL", "GOOG"],
    "open_price": [150, 152, 2800, 2820, 155, 2850],
    "close_price": [152, 151, 2820, 2790, 160, 2900]
}

df = pd.DataFrame(data)
print(df)

        date stock_name  open_price  close_price
0 2024-01-01       AAPL         150          152
1 2024-01-02       AAPL         152          151
2 2024-01-01       GOOG        2800         2820
3 2024-01-02       GOOG        2820         2790
4 2024-02-01       AAPL         155          160
5 2024-02-02       GOOG        2850         2900

In [33]:
#Calculate percentage daily return
df['daily_return'] = ((df['close_price'] - df['open_price'] / df['open_price']) * 100)
df

        date stock_name  open_price  close_price  daily_return
0 2024-01-01       AAPL         150          152       15100.0
1 2024-01-02       AAPL         152          151       15000.0
2 2024-01-01       GOOG        2800         2820      281900.0
3 2024-01-02       GOOG        2820         2790      278900.0
4 2024-02-01       AAPL         155          160       15900.0
5 2024-02-02       GOOG        2850         2900      289900.0

In [37]:
#Identify top gaining and losing stocks per month
df["month"] = df["date"].dt.to_period("M")
monthly_returns = (df.groupby(["month", "stock_name"])["daily_return"].mean())
monthly_returns

month    stock_name
2024-01  AAPL           15050.0
         GOOG          280400.0
2024-02  AAPL           15900.0
         GOOG          289900.0
Name: daily_return, dtype: float64

In [44]:
#Compute rolling volatility
rolling_volatility = (df.groupby("stock_name")["daily_return"].rolling(window = 2).std())

In [45]:
rolling_volatility

stock_name
AAPL        0            NaN
            1      70.710678
            4     636.396103
GOOG        2            NaN
            3    2121.320344
            5    7778.174593
Name: daily_return, dtype: float64

"""A DataFrame contains student_id, subject, marks, and exam_date.
Task:
Compute subject-wise pass percentage
Identify students failing in more than one subject
Generate a performance summary report
"""

In [46]:
data = {
    "student_id": [1, 1, 1, 2, 2, 3, 3, 3],
    "subject": ["Math", "Science", "English", "Math", "Science", "Math", "Science", "English"],
    "marks": [65, 35, 70, 30, 40, 25, 55, 45],
    "exam_date": pd.to_datetime(["2024-01-10", "2024-01-10", "2024-01-10", "2024-01-10", "2024-01-10", "2024-01-10", "2024-01-10", "2024-01-10"])
}

df = pd.DataFrame(data)
df

   student_id  subject  marks  exam_date
0           1     Math     65 2024-01-10
1           1  Science     35 2024-01-10
2           1  English     70 2024-01-10
3           2     Math     30 2024-01-10
4           2  Science     40 2024-01-10
5           3     Math     25 2024-01-10
6           3  Science     55 2024-01-10
7           3  English     45 2024-01-10

In [51]:
#Compute subject-wise pass percentage
PASS_MARK = 40
df["passed"] = df["marks"] >= PASS_MARK

In [52]:
subject_pass_percentage = (df.groupby("subject")["passed"].mean() * 100)
subject_pass_percentage

subject
English    100.000000
Math        33.333333
Science     66.666667
Name: passed, dtype: float64

In [55]:
#Identify students failing in more than one subject
failed_df = df[~df["passed"]]
failed_df

   student_id  subject  marks  exam_date  passed
1           1  Science     35 2024-01-10   False
3           2     Math     30 2024-01-10   False
5           3     Math     25 2024-01-10   False

In [59]:
fail_count = failed_df.groupby("student_id").size()
fail_students = fail_count[fail_count > 1]
fail_students

Series([], dtype: int64)